package autoFilled2;
// Created by ZhangJian on 17/11/13.

public class AutoFilledBondLevelConstant {

    // 手工维护的"Z"次级证券
    public static final String MANUAL_SECONDARY[] = {
            "17读秒1C", "华山C", "华润1期C", "华润1期D", "金元3C", "狮桥06C", "17先锋C1", "小米02B1", "小米02B2",
            "华融1C", "16太保1C", "金元2C", "兴光2号J", "唯品花1C", "亿利1C", "分期01B", "中建六局C", "16远东6C",
            "16新生1C", "狮桥05C", "金元C", "兴信C", "16华谊B", "金科02", "赢时通2C", "G葛洲坝B", "16平安3C",
            "普惠2C", "16远东5C", "16海尔1C", "普惠1C", "通利贷1B", "梧桐一期C", "汇通8C1", "汇通8C2", "汇通8C3",
            "汇通8C4", "汇通8C5", "中融C", "中腾信R1", "中腾信R2", "16远东4C", "16阳光C", "大融城C", "G金风绿F", "狮桥04C",
            "16东信1C", "云享权益", "16平安1C", "16吾悦C", "16远东3C", "16汇融C", "16中和1C", "16瀚华1C", "信择162C",
            "16远东2C", "16富通1C", "16巴拉C1", "16宜人D", "汇通6B", "京东1C", "16狮桥C", "金林1B", "汇通5C", "信择161C",
            "先锋E", "汇通4C1", "汇通4C2", "汇通4C3", "汇通4C4", "汇通4C5", "汇通4C6", "汇通4C7", "赢时通1C", "金坤三03",
            "嘉实建信C", "15平安C", "15蚂蚁7C", "摩山2C", "15安信C", "狮桥02C", "恒信2号C", "15蚂蚁6C", "汇通2B", "15蚂蚁5C",
            "金坤二03", "兴光1号J", "赣小贷C", "金光1B", "15蚂蚁4C", "15蚂蚁3C", "151中信4", "15远东3C", "福能融C1", "15环球C",
            "汇通1B", "金坤一03", "摩山1C", "15远东C", "15中和1C", "HLNYCJ01", "15蚂蚁2C", "镇小贷1C", "15金通C", "15蚂蚁1C",
            "14瀚华1C", "14中和1C", "14平安03", "吴中07", "17苏宁广场C", "安心贷1C", "17中和1C"
    };


    public static final String SECONDARY_SPECIALCASE[] = {
            "京东金条次优",
            "花呗分期F次优"
    };

    public static final String SECONDARY_SPECIALCASE_CONTANS_B[] = {
            "花呗", "借呗", "易鑫", "小米", "金林", "金光", "通利贷", "葛洲坝", "华谊", "分期", "亿燃"
    };

    public static final String SECONDARY_SPECIALCASE_CONTANS_C[] = {
            "读秒", "华山", "华润", "金元", "蚂蚁", "中和", "普惠", "金元", "平安", "远东", "狮桥",
            "先锋", "赢时通", "摩山", "华融", "太保", "唯品花", "亿利", "中建六局", "新生", "兴信",
            "梧桐一期", "中融", "阳光", "大融城", "东信", "吾悦", "汇融", "瀚华", "嘉实建信", "安信",
            "赣小贷", "环球", "信择", "富通", "巴拉", "恒信2号", "镇小贷", "金通", "瀚华", "安心贷",
            "苏宁广场", "福能融", "丰信", "祥达", "凤凰酒店", "杭州公积金", "中赢新易贷", "德宝天元",
            "冀租稳健", "浦发机械", "工银海天", "速利银丰", "金桥通诚", "华租稳健", "鑫石元", "深农商",
            "广农元", "珠江", "开元", "泰和", "华驭", "昆泰", "中盈", "工元", "建元", "富安", "旭越",
            "融汇", "皖金", "浦鑫", "汇通", "丰耀", "苏誉", "海田", "华永", "瑞泽", "和信", "龙居",
            "捷赢", "唯盈", "交元", "臻元", "建鑫", "惠益", "睿程", "启元", "和享", "常星", "居融",
            "充银", "龙兴", "欣荣", "融发", "兴元", "浦信", "福元", "江渝", "兴瑞", "永动", "和萃",
            "金诚", "众赢", "光盈", "浔银", "鸿富", "融腾", "金信", "芙蓉", "泉融", "兴银", "中誉",
            "杭盈", "鼎信", "钱潮", "企富", "粤鑫", "交诚", "庆春", "苏福", "亲诚", "金鹿", "紫鑫",
            "创盈", "家美", "莞盈", "楚元", "神融", "锦源", "惠金", "信融", "安赢", "长乐", "海信",
            "好运", "烟银", "蓝海", "永琪", "普盈", "鑫诚", "九通", "新锐", "海元", "桂元", "长银",
            "天元", "浙元", "润元", "永盈", "富瑞", "成银", "威元", "锦银", "江银", "臻骋", "恒丰",
            "华银", "晋元", "汇元", "华商", "渝元", "龙商", "锡元", "洪元", "江南", "上银", "冀元",
            "杭元", "青银", "九银", "徽行", "交融", "长元", "汉银", "顺元", "信银", "台银", "宝元",
            "东风", "丰元", "东元"
    };

    public static final String SECONDARY_SPECIALCASE_CONTANS_D[] = {
            "宜人",
            "华润"
    };

    public static final String SECONDARY_SPECIALCASE_CONTANS_E[] = {
            "先锋", "有钱花"
    };

    public static final String SECONDARY_SPECIALCASE_CONTANS_F[] = {
            "金风绿",
    };

    public static final String SECONDARY_SPECIALCASE_CONTANS_S_R[] = {
            "中腾信", "建元", "兴元"
    };

    public static final String SECONDARY_SPECIALCASE_CONTANS_J[] = {
            "兴光",
    };

    public static final String SECONDARY_SPECIALCASE_CONTANS_HLNYCJ[] = {
            "HLNYCJ", "新派权益级", "东元"
    };

    public static final String PRIORITY_B_SPECIALCASE_CONTANS_A[] = {
            "花呗", "借呗", "国轩", "国租", "天富", "广田", "小米", "分期", "金光"
    };

    public static final String PRIORITY_B_SPECIALCASE_CONTANS_YOUXIAN_B[] = {
            "融和绿色", "悦达租赁", "新城控股", "世贸国际", "金鹰天地", "国控租赁", "中建投租", "远东租赁", "华药商业", "中民租赁"
    };

    public static final String PRIORITY_B_SPECIALCASE[] = {
            "AUX2B", "花呗A次优", "花呗分期A次优", "海次优A", "17聚信租赁ABN001优先B1", "17聚信租赁ABN001优先B2", "17远东租赁ABN001B", "17平安租赁ABN001B", "17京东白条ABN001B", "16融和租赁ABN001B", "16远东租赁ABN001B", "13工元1AA"
    };

    public static final String SPECIALCASE_CONTANS_NOA_YOU_1[] = {
            "阿里", "PR", "京东", "龙光", "南山", "花呗", "海"
    };

    public static final String SPECIALCASE_CONTANS_NOA_YOU_2[] = {
            "京东", "红星", "小米", "雅居优", "易鑫", "金坤", "保利", "泰禾", "长江", "京美", "安鑫", "金融", "浙商", "JZT",
            "诚泰", "SKP", "PR", "YX", "枣", "人人", "凯恒", "平租", "德润", "京保", "中融", "中电", "富通", "融信", "国药",
            "海尔", "粤科", "平安", "聚信", "慧聪", "中港", "国控"
    };
    public static final String SPECIALCASE_CONTANS_NOA_YOU_3[] = {
            "融侨集团", "煦日", "聚信", "智诚", "嘉实建信", "渤银", "嘉诚", "嘉实渝信", "海南国租", "恒信", "中外贸", "有钱花"
    };
    public static final String SPECIALCASE_CONTANS_NOA_YOU_4[] = {
            "智诚", "中建六局"
    };
    public static final String SPECIALCASE_CONTANS_NOA_YOU_5[] = {
            "京东"
    };
    public static final String SPECIALCASE_CONTANS_NOA_YOU_6[] = {
            "宇商1优", "JJYH优3", "国药1优2", "顺泰1优2", "顺泰1优3", "顺泰1优4", "顺泰1优5", "顺泰1优6"
    };
    public static final String SPECIALCASE_CONTANS_NOA_YOU_7[] = {
            "浙商", "慧聪", "中港", "国控", "京东保理", "海尔", "平安", "聚信"
    };
    public static final String SPECIALCASE_CONTANS_NOA_YOU_8[] = {
            "煦日", "聚信", "嘉诚", "嘉实渝信", "有钱花"
    };
    public static final String SPECIALCASE_CONTANS_NOA_YOU_9[] = {
            "京东"
    };

    public static final String SPECIALCASE_NOA_NOYOU_1[] = {
            "JSZBHEXD", "兴光", "绍兴", "龙矿", "镇交", "金风绿"
    };
    public static final String SPECIALCASE_NOA_NOYOU_2[] = {
            "17聚02B2"
    };
    public static final String SPECIALCASE_NOA_NOYOU_3[] = {
            "普惠", "实业", "双塔", "兴光", "绍兴", "龙矿", "镇交", "金风绿", "曼听", "PRJCA", "PRCA"
    };
    public static final String SPECIALCASE_NOA_NOYOU_4[] = {
            "华远盈都", "PRCB"
    };
    public static final String SPECIALCASE_NOA_NOYOU_5[] = {
            "特锐德01", "招商创业", "畅行专项", "天电收益", "浦建收益", "莞深收益"
    };
    public static final String SPECIALCASE_NOA_NOYOU_6[] = {
            "特锐德02"
    };
    public static final String SPECIALCASE_NOA_NOYOU_7[] = {
            "特锐德03", "瑞康1中", "京东01中"
    };
    public static final String SPECIALCASE_NOA_NOYOU_8[] = {
            "兴光", "绍兴", "龙矿", "镇交", "金风绿"
    };
    public static final String SPECIALCASE_NOA_NOYOU_9[] = {
            "兴光", "绍兴", "镇交"
    };
    public static final String SPECIALCASE_NOA_NOYOU_10[] = {
            "兴光", "绍兴", "镇交"
    };
    public static final String SPECIALCASE_NOA_NOYOU_11[] = {
            "七热", "临热", "聚元", "镜泊", "融鑫", "红博", "王晁", "沣西", "阆燃",
            "惠金", "青兰路", "中民", "桥", "鄂黄桥", "荣发", "武铁", "遵义", "不动产",
            "希望学", "新华", "瑞通", "尚融", "天颐", "东方网", "世纪", "苏高速", "首创",
            "英才", "财信", "怀运", "富龙", "正商", "沪保障", "金科", "裕东", "德清",
            "葛洲坝", "葛洲", "聚元", "合生", "天成", "原", "特", "基石", "睿信",
            "高科房产", "朗诗", "水", "宏达", "民商", "泰兴", "广汇热", "华汇", "学费",
            "新热", "海航", "赁", "复地物", "武涉路", "奥凯", "源", "华凌", "漳长运",
            "金安", "华供热", "兴乾", "今典", "秦动", "铜供水", "融创物", "银河", "协电力",
            "世茂酒", "建业", "宝龙", "保利物", "凯公", "悦达", "广汇", "迎宾馆", "潍北", "启供水",
            "高燃气", "武经开", "畅融", "苏恒泰", "苏帕", "富阳", "富", "并燃气", "哈热", "东宇",
            "昆西", "三", "呼", "余燃气", "八达岭", "津桥", "先锋", "醴陵", "扬汽", "中铁", "世建",
            "渝西永", "杭公金", "丰汇", "节能", "协鑫", "庆热", "高新热", "濮热", "首航", "南山",
            "鹤热", "租", "永利电", "哈场路", "宇光", "二", "世茂天", "中联", "中信", "大丰港", "福能融",
            "滨江", "富水", "HLNYYX", "包高速", "禾燃气", "瑞热", "交", "淮运", "远东", "平安", "迁热",
            "吉城", "隧道", "网通", "山东池融", "西安高科", "工职院", "阳光城", "常州", "云公投", "惠泽",
            "苏宁二期", "金宝", "诚泰一期", "中联", "一方碧", "云龙安置", "协鑫", "金地", "新和昌", "华联",
            "池融", "晋房", "航洋", "荣物", "先锋", "阳光", "恒融号", "通天生", "苏源", "水务", "镇公",
            "镇安置", "德基", "康景", "临安公交", "蛟川汽", "华热", "泰达", "榆靖", "周燃", "华发", "鑫桥",
            "合热", "宁北", "茂庸", "鸿飞", "长经", "房信", "扬保障", "龙桥", "美兰", "陕交通", "星美",
            "凯迪", "科慧", "远东", "湘衡高", "濮水", "狮桥", "长热", "徐新盛", "阿里", "长隆", "建发房",
            "海印", "浦发", "国泰一", "澜沧江", "侨城", "宁公控", "吴中", "宁建", "澜电", "长城天骄"
    };
    public static final String SPECIALCASE_NOA_NOYOU_12[] = {
            "苏银1号", "德盈1号", "17水总01", "17畅星01", "PR宝信01", "PR宝信02", "乌经开01",
            "乌经开02", "乌经开03", "乌经开04", "乌经开05", "RP水务01", "RP水务02", "RP水务03",
            "吉水务04", "16东租01", "16东租02", "16东租03", "PR东租04", "安盈1号", "徽德一号",
            "融元1号", "普惠中间", "巩燃01", "巩燃02", "华泰1号", "RP一01", "PR01", "PR02", "PR03",
            "PR04", "PR201", "PR202", "PR205"
    };

    public static final String SPECIALCASE_NOA_NOYOU_NOB_NOC[] = {
            "京东白条1中间", "17国租A3", "17水总03", "京农1中"
    };
}
